src/DataProcessors/ЗагрузкаЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаЗаявок</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Documents/ПродажаАбонемента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПродажаАбонемента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиЗанятий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАбонемента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАбонементов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/Клиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Клиенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фио</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ЗагрузкаЗаявок/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьЗаявки(Команда)
	
	Результат = ЗагрузитьЗаявкиНaСервере();
	ПоказатьПредупреждение(, Результат);
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьЗаявкиНaСервере()
	
	ИмяФайла = "C:\FitnessClubExchange\orders.json";
	
	Файл = Новый Файл(ИмяФайла); 
	
	Если НЕ Файл.Существует() Тогда
		Возврат "Файл не найден: " + ИмяФайла;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл(ИмяФайла);
	МассивЗаявок = ПрочитатьJSON(ЧтениеJSON, Ложь);
	ЧтениеJSON.Закрыть();
	
	КоличествоСозданных = 0;
	МассивОшибок = Новый Массив;
	
	Для Каждого Заявка Из МассивЗаявок Цикл
		
		ВидАбонемента = НайтиВидАбонемента(Заявка.MembershipTypeName);
		
		Если ВидАбонемента = Неопределено Тогда
			МассивОшибок.Добавить("Не найден вид абонемента """ + Заявка.MembershipTypeName + """ для клиента " + Заявка.CustomerFullName);
			Продолжить;
		КонецЕсли;
		
		Клиент = НайтиИлиСоздатьКлиента(Заявка.CustomerFullName, Заявка.CustomerPhone);
		
		НовыйДокумент = Документы.ПродажаАбонемента.СоздатьДокумент();
		НовыйДокумент.Дата = ТекущаяДата();
		НовыйДокумент.Клиент = Клиент;
		НовыйДокумент.ВидАбонемента = ВидАбонемента;
		НовыйДокумент.Сумма = ВидАбонемента.Цена;
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
		КоличествоСозданных = КоличествоСозданных + 1;
		
	КонецЦикла;
	
	Результат = "Создано документов: " + КоличествоСозданных;
	Если МассивОшибок.Количество() > 0 Тогда
		Результат = Результат + Символы.ПС + "Ошибок: " + МассивОшибок.Количество() + Символы.ПС + СтрСоединить(МассивОшибок, Символы.ПС);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НайтиВидАбонемента(Название)
	
	Ссылка = Справочники.ВидыАбонементов.НайтиПоНаименованию(Название, Истина);
	
	Если Ссылка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиИлиСоздатьКлиента(Фио, Телефон)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Клиенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.Фио = &Фио
	|	И Клиенты.Телефон = &Телефон";
	
	Запрос.УстановитьПараметр("Фио", Фио);
	Запрос.УстановитьПараметр("Телефон", Телефон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	НовыйКлиент = Справочники.Клиенты.СоздатьЭлемент();
	НовыйКлиент.Наименование = Фио;
	НовыйКлиент.Фио = Фио;
	НовыйКлиент.Телефон = Телефон;
	НовыйКлиент.Записать();
	
	Возврат НовыйКлиент.Ссылка;
	
КонецФункции
